# 1. Створити програму, яка буде приймати число і друкувати відповідне число в послідовності Фібоначчі, використовуючи генератори.
#
# 2. Створити програму, яка буде приймати число і друкувати відповідне число в послідовності Фібоначчі, використовуючи ітератори (необов'язкове виконання).
#
# 3. Створити програму, яка буде приймати число і друкувати відповідне число в послідовності Фібоначчі, використовуючи рекурсію (необов'язкове виконання).
#
# 4. Написати програму, яка буде повертати факторіал введеного числа, використовуючи рекурсію (необов'язкове виконання).


# 2. Створити програму, яка буде приймати число і друкувати відповідне число в послідовності Фібоначчі, використовуючи ітератори
### WHILE ###
# f1 = f2 = 1
# count = 1
# a = int(input())
#
# while a > count:
#     next_sum = f1 + f2
#     f1 = f2
#     f2 = next_sum
#     print(f2)
#     count += 1


### FOR IN RANGE ###

def fibo(a):
    f1 = f2 = 1
    #a = int(input())
    for _ in range(a - 1):
        next_sum = f1 + f2
        f1 = f2
        f2 = next_sum
        print(f2)

fibo(5)

# 1. Створити програму, яка буде приймати число і друкувати відповідне число в послідовності Фібоначчі, використовуючи генератори.

# def my_gen(num):
#     f1 = f2 = 1
#     count = 1
#     while num > count:
#         next_sum = f1 + f2
#         f1 = f2
#         f2 = next_sum
#         count += 1
#         yield f2
#
# for i in my_gen(5):
#     print(i)

# 3. Створити програму, яка буде приймати число і друкувати відповідне число в послідовності Фібоначчі, використовуючи рекурсію (необов'язкове виконання).

# def fibonacci(n):
#     if n in (1, 2):
#         return 1
#     return fibonacci(n - 1) + fibonacci(n - 2)
#
#
# print(fibonacci(10))

# 4. Написати програму, яка буде повертати факторіал введеного числа, використовуючи рекурсію (необов'язкове виконання).

# def factorial(n):
#     if n == 0:
#         return 1
#     return n * factorial(n - 1)
#
# print(factorial(22))