# quess = input('Введите пароль: ')
# count = 0
# password = 'Abracadabra'
# while quess != password:
#   count += 1
#   print('Неправильный пароль')
#   quess = input('Введите пароль вновь: ')
# print('Вы угадали пароль')
# print(f'Количество неправильных попыток: {count}')

# k = 10
# z = 0
# while k <= 14:
#     z = z + k
#     k += 1
#     print(z)

# ========================== EX 1 WHILE ============================ #

# Напишите программу, которая распечатает все натуральные числа от 1000 до 2000 включительно.
#
# Каждое число следует выводить на отдельной строчке как в примере ниже

#num = 999

# while num < 2000:
#     num += 1
#     print(num)

# ========================== EX 2 WHILE ============================ #

# Напишите программу, которая распечатает все натуральные числа кратные 5 от 195 до 6785 включительно в порядке убывания.
# Каждое число следует выводить на отдельной строчке как в примере ниже
#
# 6785
# 6780
# 6775
# ...
# 205
# 200
# 195

# num = 194
#
# while num < 6785:
#     num += 1
#     if num % 5 == 0:
#         print(num)
# else:
#     print('False in while')



