######################################## PACKET MAANGERS ######################################

############################# PIP - встановлення нових модулів #################################
# ДІЇ ВИКОНУЮТЬСЯ У КОНСОЛІ

# pip install requests (НАЗВА ПАКЕТУ)

# pip freeze - ПОКАЗУЭ НАЯВНЫ ВСТАНОВЛЕННЫ ПАКЕТИ

# pip install flaskm etc, etc

# pip freeze > req.txt --> ЗАПИСУЄМО НАЗВИ ВСТАНВОНИХ ПАКЕТІВ У ОДИН ФАЙЛ

#  pip install -r C:\Users\Nikola\Robot_repo\pythonProject\13\req.txt - # ЗАВАНТАЖЕННЯ УСІ ПАКЕТИ З ФАЙЛУ

# Flask == 3.0.3 - У ВЕРСІЯХ Є ТРИ ПОЗНАЧКИ ДЛЯ ВЕРСІЙ, ТО ПЕРША ЦИФРА ЦЕ ОСНОВНІ ОНОВЛЕННЯ - MAJOR, ДРУГА ЦИФРА ЦЕ INTERMIDIANT ОНОВЛЕННЯ А ТРЕТЯ ЦИФРА ЦЕ МІНОРНІ ОНОВЛЕННЯ


######################### VIRTUALENV - свторення віртуального середовища та стоврення пакетів тільки у ньому#############################
# СИНАКСИС

# КОНСОЛЬ: python -m venv myvirtualenv(директорія) #СТОВРЕННЯ СЕРИДОВИЩА
# КОНСОЛЬ: source myvirtualenv/bin/active(шляг для активування) #АКТИВУВАННЯ
# ІНТЕРПРИТАТОР: pip install <package name> #ВСТАНОВЛЕННЯ НОВИХ МОДУЛІВ
# ІНТЕРПРИТАТОР: pip freeze > requirements.txt #ЕКСПОРТ ВСТАНОВЛЕНИХ МОДУЛІВ
# ІНТЕРПРИТАТОР: pip install -r requirements.txt # ВСТАНОВЛЕННЯ МОДУЛІВ З ФАЙЛУ

####################################### Pipenv ##############################################

# Управління залежностями з використаннямж хешів-модулів, що дозволяє встановлювати конкретно ті версії, які вказані в
# print(Pifile.lock)

####################################### Pip-tools ##############################################

# Алтернатва Pipenv

####################################### Poetry ##############################################

# Алтернатива VIRTUALENV з широкими модливостями ддля зручної публікації модулів в PyPi


############################################ ІМОРТ ФАЙЛІВ ІЗ ІНШИХ ДЕРИКТОРІЙ ######################################################

# ЩОБ ПАЙТОН МІГ РОЗПІЗНАТИ ДЕРИКТОРІЮ ЯК ТАКУ З ЯКОЇ МОЖНА ІМПОРТУВАТИ ЩОСЬ ТО ПОТРІБНО ДОДАТИ ДО НЕЇ ФАЙЛИ ФАЙЛ __init__.py Таким чином файли, що знаходяться всередені
# дерикторіх стануть доступними для імпорту.
#
# ДЛЯ ІМПОРТУ МОЖНА ВИКОРИСАТИ СТРУКТУРУ - from test import some_file І ВИКОРИСТОВУВАТИ ФУНКЦІЇ ЩО МІСЯТТЬСЯ В SOME_FILE.PY

# from test_module import functions    # ІМПОРТУЄ ФАЙЛ З ФАЙЛУ
#
# functions.test_function()

