# 1. Створити програму, яка буде очікувати введення тексту від користувача і повідомляти — чи є введений текст “числом” чи “словом”.
#
# 2. Якщо введений текст “число”, програма має також вказати чи є воно парним чи непарним.
#
# 3. Якщо це “слово”, програма має вказати його довжину.



while True:
    a = input('Введите ваш текст: ')

    if a.isdigit():
        a = int(a)
        print(f'{a} данный символ это число')
        if a % 2 == 0:
            print(f'Число {a} является парным поскольку делится без остатка')
        else:
            print(f'Число {a} не является парным')
    elif a.isalpha():
        a = str(a)
        print(f'"{a}" является словом и его длина составляет', len(a), 'символа')
    else:
        try:
            float_value = float(a)
            print(f'{a} - число с плавающей точкой {float_value}')
        except:
            print(f'{a} - тип данных не поддерживаеммый данной программой')
