# 1. Створити програму, яка буде очікувати від користувача введення тексту і виведе інформацію по кожному надрукованому символу:
#
# це “число” + яке воно (парне, непарне),
# це “буква” + яка вона (велика чи маленька),
# це “символ”


# input_text = input('Введите текст, чтобы узнать его составляющие: ')
#
# for sign in input_text:
#     print('-------Следующий символ-------')
#     if sign.isdigit():
#         sign = int(sign)
#         print(f'Символ "{sign}" является числом')
#         if sign % 2 == 0:
#             print(f'Число "{sign}" является парным')
#         else:
#             print(f'Число "{sign}" не является парным')
#     elif sign.isalpha():
#         print(f'Символ "{sign}" является буквой')
#         if sign.isupper():
#             print(f'Символ "{sign}" является большой буквой')
#         elif sign.islower():
#             print(f'Символ "{sign}" является маленькой буквой')
#     elif sign.isspace():
#         print(f'Символ "{repr(sign)}" является пробелом или табуляцией')
#     else:
#         print(f'Символ "{sign}" не поддерживается данной программой')



# 2. Створити програму, яка буде друкувати в консоль “I love Python” кожні 4.2 секунди, поки її виконання не буде перервано вручну.
#
# Підказка: для того, щоб програма могла зупинитися на вказаний час, можна використати бібліотеку time (import time), а саме функцію sleep().
# (time.sleep(second), де second, це кількість секунд, які програма має чекати).

import time
try:
    while True:
        print('I love Python')
        time.sleep(4.2)
except KeyboardInterrupt:
    print("\nПрограмма была остановлена пользователем.")







